{
    "id": 9,
    "rarity": 5,
    "weapon_type": "rectifier",
    "element": "Havoc",
    "name": "Cantarella",
    "description": "The current head of Fisalia, Cantarella, the Bane. A mysterious noblewoman, her beauty as captivating as it is perilous. She resides in a crown-like castle perched atop the mountain, where illusory dreams flow like streams, meticulously spun by her own hands.",
    "stats": {
        "HP": { "base": 928, "max": 11600 },
        "ATK": { "base": 32, "max": 400 },
        "DEF": { "base": 90, "max": 1100 },
        "crit_rate": 0.05,
        "crit_dmg": 1.5,
        "energy": 125
    },
    "active_skills": {
        "basic_attack": {
        "name": "Illusion Collapse",
        "details": {
            "Basic Attack": "Perform up to 3 consecutive attacks, dealing Havoc DMG.",
            "Heavy Attack": "Consume STA to attack the target, dealing Havoc DMG.",
            "Heavy Attack – Delusive Dive": "When Cantarella has Trance, Heavy Attack becomes Delusive Dive, dealing Havoc DMG and entering Mirage. While in Mirage, casting Delusive Dive again will not trigger Mirage again. Can be cast in water.",
            "Mid-air Attack": "Consume STA to perform a Plunging Attack, dealing Havoc DMG.",
            "Dodge Counter": "Press Normal Attack after a successful Dodge to attack the target, dealing Havoc DMG."
        }
        },
        "resonance_skill": {
        "name": "Dance with Shadows",
        "details": {
            "Graceful Step": "Attack the target, dealing Havoc DMG.",
            "Flickering Reverie": "When in Mirage, Resonance Skill becomes Flickering Reverie (considered Echo Skill), dealing Havoc DMG and sending target into Hazy Dream. Can be cast in mid-air.",
            "Hazy Dream": "Reduces target's movement speed for 6.5s. Taking damage triggers Jolt once, dealing Havoc DMG (Basic Attack DMG) and removing Hazy Dream. Coordinated Attacks and Utilities do not trigger Jolt."
        }
        },
        "resonance_liberation": {
        "name": "Beneath the Sea",
        "details": {
            "Flowing Suffocation": "Attack the target, dealing Havoc DMG (Basic Attack DMG). Grants Diffusion to all Resonators. Casting is also considered Echo Skill. Can be cast mid-air close to ground.",
            "Diffusion": "When the on-field Resonator deals DMG, summon Dreamweavers to perform Coordinated Attack, dealing Havoc DMG (Basic Attack DMG). Within 3s of dealing DMG, summon 1 Dreamweaver per second (max 21 total). Each effect lasts 30s or until reaching max Dreamweavers."
        }
        }
    },
    "forte_circuit": {
        "name": "Between Illusion and Reality",
        "details": {
            "Mirage": "Transforms Basic Attacks and abilities. • Phantom Sting (3-hit Basic Attack) • Abysmal Vortex (Mid-air) • Shadowy Sweep (Dodge Counter). Lasts 8s or until Trance is depleted.",
            "Perception Drain": "If Cantarella has 3 Shiver in Mirage, Resonance Skill becomes Perception Drain, dealing Havoc DMG, healing allies, and sending targets into Hazy Dream. Considered Basic Attack + Echo Skill. Can be cast in mid-air.",
            "Abyssal Rebirth": "After casting Intro Skill, Cantarella enters Abyssal Rebirth for 25s (cooldown 25s, up to 6 triggers). Team Echo Skills recover 6 Concerto Energy.",
            "Trance": "Hold up to 5 points. Generated by Intro, Basic Attacks, Resonance Skills, Liberation, or over time in water.",
            "Shiver": "Hold up to 3 points. Generated by Phantom Sting, Abysmal Vortex, or Shadowy Sweep."
        }
    },
    "inherent_skill1": {
        "name": "Cure",
        "description": "Increase Healing Bonus by 20%."
    },
    "inherent_skill2": {
        "name": "Poison",
        "description": "Casting Echo Skill grants 6% Havoc DMG Bonus for 10s, stacking up to 2 times."
    },
    "intro_skill": {
        "name": "Cruise",
        "description": "Attack the target, dealing Havoc DMG. Follow up with Normal Attack to continue Basic Attack Stage 3. In Mirage, becomes Tidal Surge: triggers 3 coordinated attacks and resets Phantom Sting combo."
    },
    "outro_skill": {
        "name": "Gentle Tentacles",
        "description": "Amplify the incoming Resonator's Havoc DMG by 20% and Resonance Skill DMG by 25% for 14s. Switching Resonators ends this effect."
    },
    "resonance_chain": {
        "s1": "Resonance Skill recovers 1 Trance. Increase DMG of Graceful Step, Flickering Reverie, and Perception Drain by 50%. Immune to interruptions while casting Perception Drain.",
        "s2": "Flowing Suffocation now inflicts Hazy Dream. Jolt DMG triggered by Cantarella is increased by 245%.",
        "s3": "Increase Flowing Suffocation DMG by 370%. Casting it also triggers Mirage if not already active.",
        "s4": "While in Mirage, Healing Bonus is increased by 25%.",
        "s5": "Increase maximum Dreamweavers from Diffusion by 5. Damage taken during Maestro is reduced by 30%.",
        "s6": "Increase Phantom Sting DMG by 80%. Flowing Suffocation makes DMG ignore 30% DEF for 10s. For first 1.2s of Hazy Dream, Jolt will not trigger from other DMG."
    },
    "best_weapon": 505,
    "echo_set": [1011]
}